app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "making BLOG "], ["text", "RUBY ON RAILS"], ["created_at", "2020-05-04 02:21:20.805863"], ["updated_at", "2020-05-04 02:21:20.805863"]]
---
  def create
    @article = Article.new(article_params)

    if @article.save